Tekla Open API Reference for Tekla Structures 2025
Operation.IsNumberingUpToDateAll Method
 Checks whether the numbering is up-to-date for every assembly, part and rebar on the model.
Remarks
 Using this method is much faster than checking each object individually.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsNumberingUpToDateAll()
Public Shared Function IsNumberingUpToDateAll As Boolean
Return Value
Type: Boolean
True if the numbering information is up-to-date.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace